data/2023_08_24/read_write_split_disable_with_read_pct_80_time_09_50_27/pod/test-mysql-run-80-20-8-time-2023-08-24-09-50/mysql_qps_latency.txt
run sysbench
check mysql database exists
mysql host 172.16.134.200 connect success!
database mydb exists
/usr/bin/sysbench
cd ./sysbench/src/lua;sysbench --db-driver=mysql --mysql-host=172.16.134.200 --mysql-port=3306 --mysql-user=root --mysql-password=sf2gxx9r --mysql-db=mydb --table_size=2000000 --tables=50 --time=100 --threads=8 --events=0 --percentile=99 --read-percent=80 --write-percent=20 --skip_trx=on --mysql-ignore-errors=1062 --db-ps-mode=disable --report-interval=1 oltp_read_write_pct run
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 8 tps: 86.88 qps: 9039.54 (r/w/o: 7272.97/1766.56/0.00) lat (ms,99%): 110.66 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 8 tps: 66.04 qps: 6974.07 (r/w/o: 5600.27/1373.80/0.00) lat (ms,99%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 8 tps: 80.00 qps: 7506.99 (r/w/o: 5984.00/1523.00/0.00) lat (ms,99%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 8 tps: 79.00 qps: 8256.93 (r/w/o: 6668.95/1587.99/0.00) lat (ms,99%): 112.67 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 8 tps: 74.00 qps: 7217.04 (r/w/o: 5746.03/1471.01/0.00) lat (ms,99%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 8 tps: 72.00 qps: 7343.03 (r/w/o: 5875.03/1468.01/0.00) lat (ms,99%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 8 tps: 68.00 qps: 6828.00 (r/w/o: 5437.00/1391.00/0.00) lat (ms,99%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 8 tps: 69.00 qps: 7012.99 (r/w/o: 5629.99/1383.00/0.00) lat (ms,99%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 8 tps: 77.00 qps: 7380.98 (r/w/o: 5856.99/1524.00/0.00) lat (ms,99%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 69.00 qps: 7175.97 (r/w/o: 5803.98/1372.00/0.00) lat (ms,99%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 8 tps: 75.00 qps: 7478.00 (r/w/o: 5925.00/1553.00/0.00) lat (ms,99%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 8 tps: 78.00 qps: 7873.99 (r/w/o: 6353.00/1521.00/0.00) lat (ms,99%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 8 tps: 64.00 qps: 6411.05 (r/w/o: 5113.04/1298.01/0.00) lat (ms,99%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 8 tps: 65.00 qps: 6424.96 (r/w/o: 5188.96/1235.99/0.00) lat (ms,99%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 58.00 qps: 5859.04 (r/w/o: 4614.03/1245.01/0.00) lat (ms,99%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 8 tps: 60.00 qps: 5936.00 (r/w/o: 4763.00/1173.00/0.00) lat (ms,99%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 8 tps: 58.00 qps: 5798.00 (r/w/o: 4658.00/1140.00/0.00) lat (ms,99%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 8 tps: 57.00 qps: 5536.99 (r/w/o: 4428.00/1109.00/0.00) lat (ms,99%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 8 tps: 64.00 qps: 6495.96 (r/w/o: 5172.97/1322.99/0.00) lat (ms,99%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 76.00 qps: 7614.05 (r/w/o: 6149.04/1465.01/0.00) lat (ms,99%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 8 tps: 73.00 qps: 7375.01 (r/w/o: 5852.01/1523.00/0.00) lat (ms,99%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 8 tps: 74.00 qps: 7408.88 (r/w/o: 5912.90/1495.98/0.00) lat (ms,99%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 8 tps: 80.00 qps: 7664.11 (r/w/o: 6145.09/1519.02/0.00) lat (ms,99%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 8 tps: 62.00 qps: 6249.00 (r/w/o: 4965.00/1284.00/0.00) lat (ms,99%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 74.00 qps: 7523.00 (r/w/o: 6051.00/1472.00/0.00) lat (ms,99%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 8 tps: 75.00 qps: 7597.99 (r/w/o: 6121.99/1476.00/0.00) lat (ms,99%): 127.81 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 8 tps: 72.00 qps: 7328.95 (r/w/o: 5812.96/1515.99/0.00) lat (ms,99%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 8 tps: 74.00 qps: 7293.97 (r/w/o: 5859.98/1433.99/0.00) lat (ms,99%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 8 tps: 70.00 qps: 7095.06 (r/w/o: 5656.05/1439.01/0.00) lat (ms,99%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 64.00 qps: 6278.00 (r/w/o: 5012.00/1266.00/0.00) lat (ms,99%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 8 tps: 71.00 qps: 7048.01 (r/w/o: 5669.01/1379.00/0.00) lat (ms,99%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 8 tps: 75.00 qps: 7308.00 (r/w/o: 5821.00/1487.00/0.00) lat (ms,99%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 8 tps: 74.00 qps: 7525.02 (r/w/o: 6025.01/1500.00/0.00) lat (ms,99%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 8 tps: 75.00 qps: 7444.91 (r/w/o: 5949.93/1494.98/0.00) lat (ms,99%): 127.81 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 63.00 qps: 6448.04 (r/w/o: 5165.03/1283.01/0.00) lat (ms,99%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 8 tps: 62.00 qps: 6228.03 (r/w/o: 4996.03/1232.01/0.00) lat (ms,99%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 8 tps: 60.00 qps: 5896.96 (r/w/o: 4707.97/1188.99/0.00) lat (ms,99%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 8 tps: 57.00 qps: 5746.04 (r/w/o: 4618.03/1128.01/0.00) lat (ms,99%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 8 tps: 55.00 qps: 5415.96 (r/w/o: 4332.96/1082.99/0.00) lat (ms,99%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 52.00 qps: 5307.00 (r/w/o: 4215.00/1092.00/0.00) lat (ms,99%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 8 tps: 61.00 qps: 6059.03 (r/w/o: 4863.03/1196.01/0.00) lat (ms,99%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 8 tps: 71.00 qps: 7089.00 (r/w/o: 5657.00/1432.00/0.00) lat (ms,99%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 8 tps: 74.00 qps: 7392.02 (r/w/o: 5939.01/1453.00/0.00) lat (ms,99%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 8 tps: 75.00 qps: 7520.02 (r/w/o: 6022.01/1498.00/0.00) lat (ms,99%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 74.00 qps: 7462.94 (r/w/o: 5967.95/1494.99/0.00) lat (ms,99%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 8 tps: 63.00 qps: 6295.05 (r/w/o: 5010.04/1285.01/0.00) lat (ms,99%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 8 tps: 72.00 qps: 7193.98 (r/w/o: 5772.98/1421.00/0.00) lat (ms,99%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 8 tps: 74.00 qps: 7330.99 (r/w/o: 5850.99/1480.00/0.00) lat (ms,99%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 8 tps: 76.00 qps: 7585.00 (r/w/o: 6065.00/1520.00/0.00) lat (ms,99%): 127.81 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 67.00 qps: 6972.97 (r/w/o: 5555.98/1416.99/0.00) lat (ms,99%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 8 tps: 73.00 qps: 7290.05 (r/w/o: 5840.04/1450.01/0.00) lat (ms,99%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 8 tps: 65.00 qps: 6393.99 (r/w/o: 5125.99/1268.00/0.00) lat (ms,99%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 8 tps: 76.00 qps: 7396.00 (r/w/o: 5905.00/1491.00/0.00) lat (ms,99%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 8 tps: 75.00 qps: 7411.00 (r/w/o: 5936.00/1475.00/0.00) lat (ms,99%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 67.00 qps: 6932.00 (r/w/o: 5595.00/1337.00/0.00) lat (ms,99%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 8 tps: 73.00 qps: 7064.01 (r/w/o: 5616.00/1448.00/0.00) lat (ms,99%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 8 tps: 64.00 qps: 6784.00 (r/w/o: 5422.00/1362.00/0.00) lat (ms,99%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 8 tps: 64.00 qps: 6159.99 (r/w/o: 4945.99/1214.00/0.00) lat (ms,99%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 8 tps: 57.00 qps: 5872.00 (r/w/o: 4692.00/1180.00/0.00) lat (ms,99%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 57.00 qps: 5550.00 (r/w/o: 4438.00/1112.00/0.00) lat (ms,99%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 8 tps: 55.00 qps: 5593.99 (r/w/o: 4486.99/1107.00/0.00) lat (ms,99%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 8 tps: 50.00 qps: 5082.01 (r/w/o: 4042.00/1040.00/0.00) lat (ms,99%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 8 tps: 60.00 qps: 5999.99 (r/w/o: 4802.99/1197.00/0.00) lat (ms,99%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 8 tps: 72.00 qps: 7214.02 (r/w/o: 5791.01/1423.00/0.00) lat (ms,99%): 127.81 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 8 tps: 73.00 qps: 7308.99 (r/w/o: 5830.99/1478.00/0.00) lat (ms,99%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 8 tps: 73.00 qps: 7224.02 (r/w/o: 5774.02/1450.00/0.00) lat (ms,99%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 8 tps: 77.00 qps: 7579.98 (r/w/o: 6061.98/1518.00/0.00) lat (ms,99%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 8 tps: 63.00 qps: 6396.00 (r/w/o: 5116.00/1280.00/0.00) lat (ms,99%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 8 tps: 70.00 qps: 7022.99 (r/w/o: 5650.99/1372.00/0.00) lat (ms,99%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 74.00 qps: 7450.02 (r/w/o: 5967.02/1483.00/0.00) lat (ms,99%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 8 tps: 73.00 qps: 7270.02 (r/w/o: 5838.02/1432.00/0.00) lat (ms,99%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 8 tps: 72.00 qps: 7188.98 (r/w/o: 5731.98/1457.00/0.00) lat (ms,99%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 8 tps: 74.00 qps: 7288.98 (r/w/o: 5797.98/1491.00/0.00) lat (ms,99%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 8 tps: 60.00 qps: 6167.01 (r/w/o: 4945.01/1222.00/0.00) lat (ms,99%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 8 tps: 62.00 qps: 6006.02 (r/w/o: 4774.01/1232.00/0.00) lat (ms,99%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 8 tps: 59.00 qps: 6050.00 (r/w/o: 4880.00/1170.00/0.00) lat (ms,99%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 8 tps: 57.00 qps: 5486.98 (r/w/o: 4367.98/1118.99/0.00) lat (ms,99%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 8 tps: 49.00 qps: 5147.01 (r/w/o: 4145.01/1002.00/0.00) lat (ms,99%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 8 tps: 57.00 qps: 5619.96 (r/w/o: 4448.97/1170.99/0.00) lat (ms,99%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 65.00 qps: 6524.08 (r/w/o: 5252.06/1272.01/0.00) lat (ms,99%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 8 tps: 68.00 qps: 6724.94 (r/w/o: 5339.95/1384.99/0.00) lat (ms,99%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 8 tps: 72.00 qps: 7215.04 (r/w/o: 5771.03/1444.01/0.00) lat (ms,99%): 127.81 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 8 tps: 72.00 qps: 7171.02 (r/w/o: 5777.02/1394.00/0.00) lat (ms,99%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 8 tps: 71.00 qps: 7068.97 (r/w/o: 5631.98/1436.99/0.00) lat (ms,99%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 8 tps: 64.00 qps: 6558.96 (r/w/o: 5293.97/1264.99/0.00) lat (ms,99%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 8 tps: 72.00 qps: 7122.04 (r/w/o: 5706.04/1416.01/0.00) lat (ms,99%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 8 tps: 76.00 qps: 7500.02 (r/w/o: 5935.01/1565.00/0.00) lat (ms,99%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 8 tps: 75.00 qps: 7313.96 (r/w/o: 5855.97/1457.99/0.00) lat (ms,99%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 8 tps: 73.00 qps: 7592.02 (r/w/o: 6112.01/1480.00/0.00) lat (ms,99%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 68.00 qps: 6903.01 (r/w/o: 5512.00/1391.00/0.00) lat (ms,99%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 8 tps: 68.00 qps: 6745.98 (r/w/o: 5424.99/1321.00/0.00) lat (ms,99%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 8 tps: 73.00 qps: 7245.02 (r/w/o: 5773.02/1472.00/0.00) lat (ms,99%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 8 tps: 74.00 qps: 7490.90 (r/w/o: 6005.92/1484.98/0.00) lat (ms,99%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 8 tps: 72.00 qps: 7230.07 (r/w/o: 5760.05/1470.01/0.00) lat (ms,99%): 127.81 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 8 tps: 75.00 qps: 7294.99 (r/w/o: 5840.99/1454.00/0.00) lat (ms,99%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 8 tps: 57.00 qps: 5928.04 (r/w/o: 4719.03/1209.01/0.00) lat (ms,99%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 8 tps: 34.00 qps: 3355.01 (r/w/o: 2654.01/701.00/0.00) lat (ms,99%): 549.52 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 8 tps: 72.00 qps: 7041.99 (r/w/o: 5667.99/1374.00/0.00) lat (ms,99%): 549.52 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 8 tps: 73.00 qps: 7403.98 (r/w/o: 5932.98/1471.00/0.00) lat (ms,99%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 74.00 qps: 7345.98 (r/w/o: 5874.99/1471.00/0.00) lat (ms,99%): 127.81 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            545760
        write:                           136440
        other:                           0
        total:                           682200
    transactions:                        6822   (68.16 per sec.)
    queries:                             682200 (6816.27 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0828s
    total number of events:              6822

Latency (ms):
         min:                                   71.28
         avg:                                  117.31
         max:                                  791.48
         99th percentile:                      173.58
         sum:                               800301.48

Threads fairness:
    events (avg/stddev):           852.7500/4.68
    execution time (avg/stddev):   100.0377/0.02